Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1025DAG169.atdf
      <value-group caption="EBI Address Pin Enable bit 14" name="CFGEBIA__EBIA14EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1" />
         <value caption="EBIAx pin has is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBI Address Pin Enable bit 15" name="CFGEBIA__EBIA15EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1" />
         <value caption="EBIAx pin has is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBI Address Pin Enable bit 16" name="CFGEBIA__EBIA16EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1" />
         <value caption="EBIAx pin has is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBI Address Pin Enable bit 17" name="CFGEBIA__EBIA17EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1" />
         <value caption="EBIAx pin has is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBI Address Pin Enable bit 18" name="CFGEBIA__EBIA18EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1" />
         <value caption="EBIAx pin has is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBI Address Pin Enable bit 19" name="CFGEBIA__EBIA19EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1" />
         <value caption="EBIAx pin has is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBI Address Pin Enable bit 20" name="CFGEBIA__EBIA20EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1" />
         <value caption="EBIAx pin has is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBI Address Pin Enable bit 21" name="CFGEBIA__EBIA21EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1" />
         <value caption="EBIAx pin has is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBI Address Pin Enable bit 22" name="CFGEBIA__EBIA22EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1" />
         <value caption="EBIAx pin has is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBI Address Pin Enable bit 23" name="CFGEBIA__EBIA23EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1" />
         <value caption="EBIAx pin has is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBI Data Upper Byte Pin Enable bit" name="CFGEBIC__EBIDEN0">
         <value caption="EBID pins are enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBID pins have reverted to general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBI Data Upper Byte Pin Enable bit" name="CFGEBIC__EBIDEN1">
         <value caption="EBID pins are enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBID pins have reverted to general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBICS0 Pin Enable bit" name="CFGEBIC__EBICSEN0">
         <value caption="EBICS0 pin is enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBICS0 pin is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBICS1 Pin Enable bit" name="CFGEBIC__EBICSEN1">
         <value caption="EBICS1 pin is enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBICS1 pin is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBICS2 Pin Enable bit" name="CFGEBIC__EBICSEN2">
         <value caption="EBICS2 pin is enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBICS2 pin is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBICS3 Pin Enable bit" name="CFGEBIC__EBICSEN3">
         <value caption="EBICS3 pin is enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBICS3 pin is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBIBS0 Pin Enable bit" name="CFGEBIC__EBIBSEN0">
         <value caption="EBIBS0 pin is enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBIBS0 pin is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBIBS1 Pin Enable bit" name="CFGEBIC__EBIBSEN1">
         <value caption="EBIBS1 pin is enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBIBS1 pin is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBIOE Pin Enable bit" name="CFGEBIC__EBIOEEN">
         <value caption="EBIOE pin is enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBIOE pin is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBIWE Pin Enable bit" name="CFGEBIC__EBIWEEN">
         <value caption="EBIWE pin is enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBIWE pin is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBIRP Pin Sensitivity Control bit" name="CFGEBIC__EBIRPEN">
         <value caption="EBIRP pin is enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBIRP pin is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBIRDYx Pin Sensitivity Control bit" name="CFGEBIC__EBIRDYLVL">
         <value caption="Use level detect for EBIRDYx pins" name="" value="0x1" />
         <value caption="Use edge detect for EBIRDYx pins" name="" value="0x0" />
      </value-group>
      <value-group caption="EBIRDY1 Pin Enable bit" name="CFGEBIC__EBIRDYEN1">
         <value caption="EBIRDY1 pin is enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBIRDY1 pin is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBIRDY2 Pin Enable bit" name="CFGEBIC__EBIRDYEN2">
         <value caption="EBIRDY2 pin is enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBIRDY2 pin is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBIRDY3 Pin Enable bit" name="CFGEBIC__EBIRDYEN3">
         <value caption="EBIRDY3 pin is enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBIRDY3 pin is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBIRDY1 Inversion Control bit" name="CFGEBIC__EBIRDYINV1">
         <value caption="Invert EBIRDY1 pin before use" name="" value="0x1" />
         <value caption="Do not invert EBIRDY1 pin before use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBIRDY2 Inversion Control bit" name="CFGEBIC__EBIRDYINV2">
         <value caption="Invert EBIRDY2 pin before use" name="" value="0x1" />
         <value caption="Do not invert EBIRDY2 pin before use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBIRDY3 Inversion Control bit" name="CFGEBIC__EBIRDYINV3">
         <value caption="Invert EBIRDY3 pin before use" name="" value="0x1" />
         <value caption="Do not invert EBIRDY3 pin before use" name="" value="0x0" />
      </value-group>
      <value-group caption="CPU Permission Group bits" name="CFGPG__CPUPG">
         <value caption="Initiator is assigned to Permission Group 3" name="" value="0x3" />
         <value caption="Initiator is assigned to Permission Group 2" name="" value="0x2" />
         <value caption="Initiator is assigned to Permission Group 1" name="" value="0x1" />
         <value caption="Initiator is assigned to Permission Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Module Permission Group bits" name="CFGPG__DMAPG">
         <value caption="Initiator is assigned to Permission Group 3" name="" value="0x3" />
         <value caption="Initiator is assigned to Permission Group 2" name="" value="0x2" />
         <value caption="Initiator is assigned to Permission Group 1" name="" value="0x1" />
         <value caption="Initiator is assigned to Permission Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Module Permission Group bits" name="CFGPG__USBPG">
         <value caption="Initiator is assigned to Permission Group 3" name="" value="0x3" />
         <value caption="Initiator is assigned to Permission Group 2" name="" value="0x2" />
         <value caption="Initiator is assigned to Permission Group 1" name="" value="0x1" />
         <value caption="Initiator is assigned to Permission Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN1 Module Permission Group bits" name="CFGPG__CAN1PG">
         <value caption="Initiator is assigned to Permission Group 3" name="" value="0x3" />
         <value caption="Initiator is assigned to Permission Group 2" name="" value="0x2" />
         <value caption="Initiator is assigned to Permission Group 1" name="" value="0x1" />
         <value caption="Initiator is assigned to Permission Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN2 Module Permission Group bits" name="CFGPG__CAN2PG">
         <value caption="Initiator is assigned to Permission Group 3" name="" value="0x3" />
         <value caption="Initiator is assigned to Permission Group 2" name="" value="0x2" />
         <value caption="Initiator is assigned to Permission Group 1" name="" value="0x1" />
         <value caption="Initiator is assigned to Permission Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Ethernet Module Permission Group bits" name="CFGPG__ETHPG">
         <value caption="Initiator is assigned to Permission Group 3" name="" value="0x3" />
         <value caption="Initiator is assigned to Permission Group 2" name="" value="0x2" />
         <value caption="Initiator is assigned to Permission Group 1" name="" value="0x1" />
         <value caption="Initiator is assigned to Permission Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Secure Digital Host Controller Permission Group bits" name="CFGPG__SDHCPG">
         <value caption="Initiator is assigned to Permission Group 3" name="" value="0x3" />
         <value caption="Initiator is assigned to Permission Group 2" name="" value="0x2" />
         <value caption="Initiator is assigned to Permission Group 1" name="" value="0x1" />
         <value caption="Initiator is assigned to Permission Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="SQI Module Permission Group bits" name="CFGPG__SQI1PG">
         <value caption="Initiator is assigned to Permission Group 3" name="" value="0x3" />
         <value caption="Initiator is assigned to Permission Group 2" name="" value="0x2" />
         <value caption="Initiator is assigned to Permission Group 1" name="" value="0x1" />
         <value caption="Initiator is assigned to Permission Group 0" name="" value="0x0" />
      </value-group>
